%% 本脚本的目标是对数据进行预处理，并输出训练样本、验证样本以及测试样本
tic;
%% 读取数据，输入参数
% %编号 14及以前的数据处理
% %将每个轨迹点对应的机动车和非机动车坐标放到同一行上,14列
% [E1]=xlsread('D:\文件\交科赛大三\交叉口各类车型轨迹数据\交叉口各类车型轨迹数据\初始轨迹数据-汇总\15_国定路-邯郸路_转换后轨迹数据.xlsx',1);%东进口直行非机动车
% %轨迹编号 时间 x y
% E1= [E1(:,2) E1(:,8:10)];
% % ID = find(E1(:,1)==1);
% % scatter(E1(ID,3),E1(ID,4),'.','r');%做某一轨迹的图
% scatter(E1(:,3),E1(:,4),'.','r');%做全部点的图

%编号15以后的数据处理
[E1]=xlsread('D:\文件\交科赛大三\交叉口各类车型轨迹数据\交叉口各类车型轨迹数据\初始轨迹数据-汇总\21_宁武路-河间路_转换后轨迹数据.xlsx',1);%东进口直行非机动车
%轨迹编号 时间 x y
E1= [E1(:,1) E1(:,6:8)];
% ID = find(E1(:,1)==1);
% scatter(E1(ID,3),E1(ID,4),'.','r');%做某一轨迹的图
scatter(E1(:,3),E1(:,4),'.','r');%做全部点的图